<!DOCTYPE html>
<html>
<head>
     <title>Hello World!</title>
</head>
<body>
Задание 3. Помочь ученикам в изучении странной математики

В связи с реформой образования был введен новый предмет, на котором изучаются различные альтернативные науки. Одной из таких наук является странная математика. Её основное отличие от обычной математики в том, что числа в ней упорядочены не по возрастанию, а лексикографически, то есть как в словаре (сначала по первой цифре, затем, при равной первой цифре – по второй, и так далее). Кроме того, рассматривается не бесконечное множество натуральных чисел, а лишь первые n чисел. Так, например, если n=11, то числа в странной математике оказываются упорядочены следующим образом: 1, 10, 11, 2, 3, 4, 5, 6, 7, 8, 9.

Помогите ученикам в изучении этой науки – напишите программу, которая по заданному n находит место заданного числа k в порядке, определенном в странной математике. Например, если n=11 и k=2, программа должна выдать в качестве ответа 4.

Результат: ссылка на github с кодом и ваши комментарии.

Если у тебя появятся какие-то вопросы, пиши. Дедлайн приёма тестовых — до понедельника 12.00.

Желаю успехов!
</body>

